formik, react-form - работа с формами. formik не нужно привязывать к redux state
react-redux, ModX - работа с BLL функциональная и ООП разработка
prop-types - проверка типов
Yup -  проверка типов + валидация. построент на Set Map для старых браузеров нужен полифил 'core-js/es6/set'
         так же при использовании TypeScript нужен npm install -D @types/yup
@material-ui/core(1 255 387), StyledComponents(1 881 181), Ant.Design(481 454) - готовые стили + настройка

GraphQL - это язык запросов для API. Надо почитать
passport.js - аутентификации в Node.js из сторонних сервисов (vk, google и т.д...)
jsonwebtoken - получение токена
//для css
stylelint - тот же eslint только для css. Если делаю ошибки, то поможет их обранужить
Doiuse - какой-то плагин который может подсказать глядя на код какие свойства не поддерживаються
         теми браузерами которые мы ему указали. Но нас выручает Autoprefixer

React Styleguidist - библиотека упрощает создание логики компонентов таким образом что бы
                      можно было показать дизайнеру как компонент работает
node-sass - для работы с scss
ClassNames - библиотека для удобного управления классами. Ключ-класс, значение-bool 
moment(13 089 119), date-fns(7 301 377)- библиотеки для работы с датами
Particles.js летающая паутина